tutorials/compressible/rhoCentralDyMFoam/shockCube/system/minMax
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

minMax
{
    // Type of functionObject
    type            fieldMinMax;

    // Where to load it from (if not already in solver)
    functionObjectLibs ("libfieldFunctionObjects.so");

    // Log to output (default: false)
    log             true;

    // Write information to file (default: true)
    write           false;

    // Fields to be monitored - runTime modifiable
    fields
    (
        U
        p
        T
        rho
    );
}

// ************************************************************************* //
