tutorials/compressible/rhoCentralDyMFoam/shockCube/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    // Select cells to remove
    {
        name    c0;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
            box (0.6 0 0)(1.2 0.3 0.3);
            //box (0.3 0 0)(1000 0.3 0.3);
        }
    }

    // Determine inverse cellSet
    {
        name    c0;
        type    cellSet;
        action  invert;
    }
);

// ************************************************************************* //
